# ExternallyTaggedBRep Properties

---
The ExternallyTaggedBRep type exposes the following members.
| Name| Description
---|---|---
| ExternalId|  The external Id of the geometry object. (Inherited from ExternallyTaggedGeometryObject)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ExternallyTaggedGeometryObject)
Top
#### Reference
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace